#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_region.current: Reading...
module.eks_admins_iam_group.data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.user1_iam_user.aws_iam_user.this[0]: Refreshing state... [id=user1]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/cluster-dev/cluster]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Reading...
module.eks.data.aws_partition.current[0]: Reading...
module.eks_admins_iam_group.data.aws_caller_identity.current[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-07c22188d27bf4c14]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_admins_iam_group.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_region.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.karpenter.data.aws_caller_identity.current: Reading...
module.karpenter.data.aws_partition.current: Reading...
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.allow_eks_access_iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::509399618437:policy/allow-eks-access]
data.aws_iam_policy_document.aws_lbc: Reading...
aws_iam_policy.eks_admin: Refreshing state... [id=arn:aws:iam::509399618437:policy/AmazonEKSAdminPolicy]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.aws_lbc: Read complete after 0s [id=819195744]
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
aws_iam_user.manager: Refreshing state... [id=manager]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
aws_iam_policy.aws_lbc: Refreshing state... [id=arn:aws:iam::509399618437:policy/AWSLoadBalancerController]
module.eks_admins_iam_group.data.aws_caller_identity.current[0]: Read complete after 0s [id=509399618437]
module.eks_admins_iam_group.aws_iam_group.this[0]: Refreshing state... [id=eks-admin]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-eks-node-group-20241201032435379900000003]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=cluster-dev-cluster-20241201032435376800000001]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20241201032435379700000002]
aws_iam_role.aws_lbc: Refreshing state... [id=dev-aws-lbc]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=509399618437]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.eks_admins_iam_group.data.aws_iam_policy_document.iam_self_management: Reading...
module.eks_admins_iam_group.data.aws_iam_policy_document.iam_self_management: Read complete after 0s [id=3966440753]
module.eks_admins_iam_group.aws_iam_group_membership.this[0]: Refreshing state... [id=eks-admin]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=cluster-dev-cluster-20241201032435376800000001-20241201032435706400000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=cluster-dev-cluster-20241201032435376800000001-20241201032435698800000007]
aws_iam_role_policy_attachment.aws_lbc: Refreshing state... [id=dev-aws-lbc-20241201032435663800000004]
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=509399618437]
module.eks.data.aws_caller_identity.current[0]: Read complete after 1s [id=509399618437]
module.eks.data.aws_iam_session_context.current[0]: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=509399618437]
aws_iam_role.eks_admin: Refreshing state... [id=dev-eks-admin]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 1s [id=509399618437]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-eks-node-group-20241201032435379900000003-20241201032435701000000008]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-eks-node-group-20241201032435379900000003-20241201032435686700000006]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-eks-node-group-20241201032435379900000003-20241201032435673800000005]
data.aws_availability_zones.available: Read complete after 1s [id=ap-south-1]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::509399618437:assumed-role/aws-github-oidc/aws-github-oidc]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2142778359]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=6f848815-c80d-4267-b9a2-f2dd209a845c]
aws_iam_role_policy_attachment.eks_admin: Refreshing state... [id=dev-eks-admin-2024120103243576730000000a]
aws_iam_policy.eks_assume_admin: Refreshing state... [id=arn:aws:iam::509399618437:policy/AmazonEKSAssumeAdminPolicy]
aws_iam_user_policy_attachment.manager: Refreshing state... [id=manager-2024120103243589070000000b]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/cluster-dev]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::509399618437:policy/cluster-dev-cluster-ClusterEncryption20241201032500728000000013]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=cluster-dev-cluster-20241201032435376800000001-20241201032500940000000014]
module.eks_admins_iam_role.data.aws_iam_policy_document.assume_role[0]: Reading...
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-005e05ddfd474e000]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-001910d809f6a4e51]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0624965c368453440]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f7dc991a068da6f2]
module.eks_admins_iam_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=712609775]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0158534ec4483259c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02d328c6ea7432984]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b15e3c2b85784ade]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ed3e646feb8e33fd]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-05ddb671d975d6109]
module.eks_admins_iam_role.aws_iam_role.this[0]: Refreshing state... [id=eks-admin]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-03807e5b54eda924d]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-07985f6188f5bf88c]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03cb3d0eeb21bdba6]
module.eks_admins_iam_role.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=eks-admin-20241201032451391600000010]
module.allow_assume_eks_admins_iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::509399618437:policy/allow-assume-eks-admin-iam-role]
module.eks_admins_iam_group.aws_iam_group_policy_attachment.custom_arns[0]: Refreshing state... [id=eks-admin-20241201032451545900000011]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1914645229]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-4283667351]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-107222704]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1287897620]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-907146241]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1521356366]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-4277251489]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2604778841]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2293144701]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3960450998]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2932562361]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02d328c6ea74329841080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03b5e83e2954b21b9]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ddb3d0d5b180b767]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-06685c6c23a6404a0]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d3d4a5575e35d376]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a8787133c4164a20]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=cluster-dev]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-02bc83353cd49a4f8]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f7dc991a068da6f21080289494]
module.eks.aws_ec2_tag.cluster_primary_security_group["terraform"]: Refreshing state... [id=sg-00d07eff85edaa1df,terraform]
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-00d07eff85edaa1df,Environment]
module.eks.aws_eks_access_entry.this["example"]: Refreshing state... [id=cluster-dev:arn:aws:iam::509399618437:root]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.aws_ec2_tag.cluster_primary_security_group["Owner"]: Refreshing state... [id=sg-00d07eff85edaa1df,Owner]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-00d07eff85edaa1df,Project]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=cluster-dev:arn:aws:iam::509399618437:role/aws-github-oidc]
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-12-01T03:33:07Z]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.module.eks_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=8570574906407940679]
module.eks.module.eks_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-03f55b10d6ac03654]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 0s [id=eks-pod-identity-agent]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=cluster-dev#arn:aws:iam::509399618437:role/aws-github-oidc#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_access_policy_association.this["example_example"]: Refreshing state... [id=cluster-dev#arn:aws:iam::509399618437:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=8620fd676f1f5fb482fb77207743ac75042750fa]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::509399618437:oidc-provider/oidc.eks.ap-south-1.amazonaws.com/id/ACA1EEBCCCE560B1FD8489964B6410CE]
module.eks.module.eks_managed_node_group["karpenter"].aws_eks_node_group.this[0]: Refreshing state... [id=cluster-dev:karpenter-20241201033314934900000024]
data.aws_eks_cluster_auth.default: Reading...
aws_eks_access_entry.manager: Refreshing state... [id=cluster-dev:arn:aws:iam::509399618437:role/dev-eks-admin]
aws_eks_pod_identity_association.aws_lbc: Refreshing state... [id=a-3wtw5n6gamzdc0mcf]
data.aws_eks_cluster_auth.default: Read complete after 0s [id=cluster-dev]
module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-injy21edmsjhpoosr]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20241201033239137700000019]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20241201033239136400000018]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=Karpenter-cluster-dev-2024120103323913810000001a]
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-2024120103323919080000001b]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.ap-south-1.amazonaws.com/509399618437/Karpenter-cluster-dev]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20241201033239136100000017]
helm_release.updater: Refreshing state... [id=updater]
helm_release.argocd: Refreshing state... [id=argocd]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=Karpenter-cluster-dev-2024120103323913810000001a-2024120103324067960000001c]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=Karpenter-cluster-dev-2024120103323913810000001a-2024120103324072640000001e]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=Karpenter-cluster-dev-2024120103323913810000001a-2024120103324074520000001f]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=Karpenter-cluster-dev-2024120103323913810000001a-2024120103324072050000001d]
module.eks.aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=cluster-dev:eks-pod-identity-agent]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=cluster-dev:vpc-cni]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=cluster-dev:coredns]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=cluster-dev:kube-proxy]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
helm_release.karpenter: Refreshing state... [id=karpenter]
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=221800040]
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.ap-south-1.amazonaws.com/509399618437/Karpenter-cluster-dev]
helm_release.metrics_server: Refreshing state... [id=metrics-server]
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=2537759366]
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=1440353085]
helm_release.aws_lbc: Refreshing state... [id=aws-load-balancer-controller]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20241201033239136100000017-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-2024120103323919080000001b-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20241201033239136400000018-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20241201033239137700000019-KarpenterInterruptionQueueTarget]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=2537759366]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=cluster-dev:arn:aws:iam::509399618437:role/Karpenter-cluster-dev-2024120103323913810000001a]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::509399618437:policy/KarpenterController-20241201033308267400000020]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20241201032435379700000002-20241201033308479500000023]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.aws_eks_cluster.this[0] has changed
  ~ resource "aws_eks_cluster" "this" {
        id                            = "cluster-dev"
        name                          = "cluster-dev"
        tags                          = {
            "Environment"           = "sandbox"
            "Owner"                 = "Durgaprasad"
            "Project"               = "EKS-DNS-setup"
            "terraform"             = "true"
            "terraform-aws-modules" = "eks"
        }
        # (12 unchanged attributes hidden)

      ~ kubernetes_network_config {
            # (3 unchanged attributes hidden)

          + elastic_load_balancing {
              + enabled = false
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["karpenter"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "cluster-dev:karpenter-20241201033314934900000024"
      + labels                 = {}
        tags                   = {
            "Environment" = "sandbox"
            "Name"        = "karpenter"
            "Owner"       = "Durgaprasad"
            "Project"     = "EKS-DNS-setup"
            "terraform"   = "true"
        }
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.argocd is tainted, so must be replaced
-/+ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v2.2.5"
              - chart          = "argo-cd"
              - first_deployed = 1733023965
              - last_deployed  = 1733023965
              - name           = "argocd"
              - namespace      = "argocd"
              - notes          = <<-EOT
                    In order to access the server UI you have the following options:
                    
                    1. kubectl port-forward service/argocd-server -n argocd 8080:443
                    
                        and then open the browser on http://localhost:8080 and accept the certificate
                    
                    2. enable ingress in the values file `server.ingress.enabled` and either
                          - Add the annotation for ssl passthrough: https://github.com/argoproj/argo-cd/blob/master/docs/operator-manual/ingress.md#option-1-ssl-passthrough
                          - Add the `--insecure` flag to `server.extraArgs` in the values file and terminate SSL at your ingress: https://github.com/argoproj/argo-cd/blob/master/docs/operator-manual/ingress.md#option-2-multiple-ingress-objects-and-hosts
                    
                    
                    After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                    
                    kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                    
                    (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://github.com/argoproj/argo-cd/blob/master/docs/getting_started.md#4-login-using-the-cli)
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - global = {
                          - image = {
                              - tag = "v2.12.6"
                            }
                        }
                      - server = {
                          - extraArgs = [
                              - "--insecure",
                            ]
                        }
                    }
                )
              - version        = "3.35.4"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

  # helm_release.aws_lbc is tainted, so must be replaced
-/+ resource "helm_release" "aws_lbc" {
      ~ id                         = "aws-load-balancer-controller" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v2.9.2"
              - chart          = "aws-load-balancer-controller"
              - first_deployed = 1733024159
              - last_deployed  = 1733024159
              - name           = "aws-load-balancer-controller"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    AWS Load Balancer controller installed!
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - clusterName    = "cluster-dev"
                      - serviceAccount = {
                          - name = "aws-load-balancer-controller"
                        }
                      - vpcId          = "vpc-07c22188d27bf4c14"
                    }
                )
              - version        = "1.9.2"
            },
        ] -> (known after apply)
        name                       = "aws-load-balancer-controller"
      ~ status                     = "failed" -> "deployed"
        # (25 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # helm_release.metrics_server is tainted, so must be replaced
-/+ resource "helm_release" "metrics_server" {
      ~ id                         = "metrics-server" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "0.7.1"
              - chart          = "metrics-server"
              - first_deployed = 1733024157
              - last_deployed  = 1733024157
              - name           = "metrics-server"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    ***********************************************************************
                    * Metrics Server                                                      *
                    ***********************************************************************
                      Chart version: 3.12.1
                      App version:   0.7.1
                      Image tag:     registry.k8s.io/metrics-server/metrics-server:v0.7.1
                    ***********************************************************************
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - defaultArgs = [
                          - "--cert-dir=/tmp",
                          - "--kubelet-preferred-address-types=InternalIP,ExternalIP,Hostname",
                          - "--kubelet-use-node-status-port",
                          - "--metric-resolution=15s",
                          - "--secure-port=10250",
                        ]
                    }
                )
              - version        = "3.12.1"
            },
        ] -> (known after apply)
        name                       = "metrics-server"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

  # helm_release.updater is tainted, so must be replaced
-/+ resource "helm_release" "updater" {
      ~ id                         = "updater" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v0.12.2"
              - chart          = "argocd-image-updater"
              - first_deployed = 1733023961
              - last_deployed  = 1733023961
              - name           = "updater"
              - namespace      = "argocd"
              - revision       = 1
              - values         = jsonencode(
                    {
                      - image   = {
                          - tag = "v0.12.2"
                        }
                      - metrics = {
                          - enabled = true
                        }
                    }
                )
              - version        = "0.9.1"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        name                       = "updater"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

  # kubectl_manifest.karpenter_node_class will be created
  + resource "kubectl_manifest" "karpenter_node_class" {
      + api_version             = "karpenter.k8s.aws/v1beta1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "EC2NodeClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1beta1
            kind: EC2NodeClass
            metadata:
              name: default
            spec:
              amiFamily: AL2023
              role: Karpenter-cluster-dev-2024120103323913810000001a
              securityGroupSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cluster-dev
              subnetSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cluster-dev
              tags:
                karpenter.sh/discovery: cluster-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter_node_pool will be created
  + resource "kubectl_manifest" "karpenter_node_pool" {
      + api_version             = "karpenter.sh/v1beta1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1beta1
            kind: NodePool
            metadata:
              name: default
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmpty
              limits:
                cpu: 1000
              template:
                spec:
                  nodeClassRef:
                    name: default
                  requirements:
                  - key: karpenter.k8s.aws/instance-category
                    operator: In
                    values:
                    - c
                    - m
                    - r
                  - key: karpenter.k8s.aws/instance-cpu
                    operator: In
                    values:
                    - "4"
                    - "8"
                    - "16"
                    - "32"
                  - key: karpenter.k8s.aws/instance-hypervisor
                    operator: In
                    values:
                    - nitro
                  - key: karpenter.k8s.aws/instance-generation
                    operator: Gt
                    values:
                    - "2"
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.eks.aws_iam_policy.custom[0] will be created
  + resource "aws_iam_policy" "custom" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "cluster-dev-cluster-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:RunInstances",
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                          + StringLike   = {
                              + "aws:RequestTag/eks:kubernetes-node-class-name" = "*"
                              + "aws:RequestTag/eks:kubernetes-node-pool-name"  = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "Compute"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                          + "ec2:CreateSnapshot",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                      + Sid       = "Storage"
                    },
                  + {
                      + Action    = "ec2:CreateNetworkInterface"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name"         = "${aws:PrincipalTag/eks:eks-cluster-name}"
                              + "aws:RequestTag/eks:kubernetes-cni-node-name" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "Networking"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateListener",
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "LoadBalancer"
                    },
                  + {
                      + Action    = "shield:CreateProtection"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ShieldProtection"
                    },
                  + {
                      + Action    = "shield:TagResource"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:shield::*:protection/*"
                      + Sid       = "ShieldTagResource"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
    }

  # module.eks.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "sts:AssumeRole" -> [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "cluster-dev-cluster-20241201032435376800000001"
        name                  = "cluster-dev-cluster-20241201032435376800000001"
        tags                  = {
            "Environment" = "sandbox"
            "Owner"       = "Durgaprasad"
            "Project"     = "EKS-DNS-setup"
            "terraform"   = "true"
        }
        # (11 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cluster-dev-cluster-20241201032435376800000001"
    }

Plan: 8 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @durga61, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform AWS infra creation`*